<template>
  <section class="adaptive-page-diff">
    <h3>Яка різниця між адаптивним та гнучким дизайном?</h3>
    <p>
  Хоча терміни "адаптивний" та "гнучкий" дизайн часто використовуються як синоніми, вони вказують на різні аспекти веб-розробки. Давайте розглянемо основні відмінності між адаптивним та гнучким дизайном:</p>
  <img class="adaptive-page-diff__img" alt="Різниця між адаптивним та гнучким дизайном" :src="differences">
  <h4>Адаптивний Дизайн (Adaptive Design)</h4>
  <h5>Медіазапити</h5>
  <ul>
    <li>
      Адаптивний дизайн використовує медіазапити для зміни стилів та макету в залежності від характеристик екрану (ширина, висота)
    </li>
    <li>
      Зазвичай використовується медіазапити для розмежування стилів для різних пристроїв.
    </li>
  </ul>
  <h5>Різні Версії Для Різних Екранів</h5>
  <ul>
    <li>
      Створення різних версій дизайну для різних типів пристроїв.  
    </li>
    <li>
      На великих екранах може використовувати широкі макети та додаткові функції, в той час як на малих екранах - обмежені та спрощені версії.
    </li>
  </ul>
  <h5>Підходить Для Різних Розмірів</h5>
  <ul>
    <li>
      Адаптивний дизайн спроектований для підтримки широкого спектру розмірів екранів.  
    </li>
    <li>
      Підходить як для десктопів, так і для планшетів та мобільних пристроїв.
    </li>
  </ul>
  <h4>Гнучкий Дизайн (Fluid Design)</h4>
  <h5>Відсутність Фіксованих Розмірів</h5>
  <ul>
    <li>
      Гнучкий дизайн не використовує фіксовані піксельні розміри для елементів.
    </li>
    <li>
      Розміри елементів визначаються відсотками або іншими відносинами, щоб забезпечити гнучкість.
    </li>
  </ul>
  <h5>Автоматична Адаптація</h5>
  <ul>
    <li>
      Елементи автоматично адаптуються до розмірів екрану без використання медіазапитів.
    </li>
    <li>
      Зазвичай використовується процентна ширина для контейнерів та елементів, щоб вони розтягувалися або стискалися.
    </li>
  </ul>
  <h5>Спрощення Для Мобільних Версій</h5>
  <ul>
    <li>
      Використання гнучкого дизайну дозволяє легко переходити до спрощених мобільних версій без значного перепроектування.
    </li>
    <li>
      Зазвичай підтримує масштабованість для мобільних та десктопних екранів без різних версій.
    </li>
  </ul>
  <h5>Висока Гнучкість</h5>
  <ul>
    <li>
      Здатність елементів гнучко підлаштовуватися до розмірів екрану забезпечує високу гнучкість
    </li>
    <li>
      Підходить для різних пристроїв без розділення на конкретні версії.
    </li>
  </ul>
  <p>Обидва підходи можуть використовуватися в комбінації або окремо в залежності від потреб проекту та веб-розробника.</p>
  </section>
</template>

<script>
import ResponsiveImg from '@/assets/ResponsiveVsAdaptiveAnimation.gif'

export default {
  name: 'adaptive-page-diff',
  data () {
    return {
      differences: ResponsiveImg
    }
  }
}
</script>