<template>
  <section>
    <h2>Коли використовувати кожен?</h2>
    <ul>
      <li>Використовуйте <strong>Flexbox</strong>, коли вам потрібно орієнтуватися на одному напрямку та контролювати прості або динамічні розташування елементів.</li>
      <li>Використовуйте <strong>Grid</strong>, коли вам потрібен значний контроль над областями та вам потрібна можливість працювати з двовимірними макетами.</li>
      <li>У багатьох випадках вони можуть використовуватися разом: Flexbox в межах елементів Grid для досягнення більшого рівня гнучкості та контролю.</li>
    </ul>
  </section>
</template>

<script>
export default {
  name: 'flex-grid-page'
}
</script>