<template>
  <section class="tips-page-hero">
    <h1>Поради і рекомендаціЇ</h1>
    <p>Створення веб-сайту з використанням CSS3 може бути захоплюючим та творчим завданням. Щоб забезпечити ефективний та професійний дизайн, ось кілька порад та рекомендацій:</p>
    <div class="tips-page-hero__accordions">
      <accordion-item title="Розплануйте проєкт">
        <ul>
          <li>Визначте мету та цільову аудиторію веб-сайту.</li>
          <li>Створіть складний план проекту з визначенням функціональних вимог та структури сайту.</li>
        </ul>
      </accordion-item>
      <accordion-item title="Мобільна першість">
        <ul>
          <li>Забезпечте адаптивний дизайн для оптимального відображення на різних пристроях.</li>
          <li>Використовуйте медіа-запити для стилізації елементів в залежності від розміру екрану.</li>
        </ul>
      </accordion-item>
      <accordion-item title="Спрощений та оптимізований код">
        <ul>
          <li>Уникайте надмірного використання вкладених стилів.</li>
          <li>Зберігайте код організовано та чисто, використовуючи зручні імена класів та ідентифікаторів.</li>
        </ul>
      </accordion-item>
      <accordion-item title="Використання Flexbox та Grid">
        <ul>
          <li>Використовуйте Flexbox та Grid для створення гнучких та респонсивних макетів.</li>
          <li>Це полегшить розташування елементів на сторінці та зменшить потребу в складних CSS-правилах.</li>
        </ul>
      </accordion-item>
      <accordion-item title="Кросбраузерність">
        <ul>
          <li>Перевірте та забезпечте сумісність вашого коду з різними веб-браузерами.</li>
          <li>Використовуйте вендор-префікси для CSS3-властивостей, якщо це необхідно.</li>
        </ul>
      </accordion-item>
      <accordion-item title="Оптимізація зображень">
        <ul>
          <li>Зменшуйте розмір зображень перед використанням на сайті.</li>
          <li>Використовуйте формати, такі як WebP, для досягнення кращого стиснення без втрати якості.</li>
        </ul>
      </accordion-item>
      <accordion-item title="Тестування та відладка">
        <ul>
          <li>Перевірте веб-сайт на різних браузерах для впевненості в його правильному відображенні.</li>
          <li>Використовуйте інструменти розробника для відлагодження та виправлення помилок.</li>
        </ul>
      </accordion-item>
    </div>
  </section>
</template>


<script>
import AccordionItem from '@/components/AccordionItem.vue';

export default {
  name: 'tips-page-hero',
  components: {
    AccordionItem
  }
}
</script>

<style>
.tips-page-hero__accordions {
  display: flex;
  flex-direction: column;
  gap: 15px;
}
</style>